tutorials/testcases/flowOverCylinder/cylinder_multiphase_neu/3d/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.1.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.3535533905932738 0.3535533905932738 -0.2) // 0
    (-0.3535533905932738 0.3535533905932738 -0.2) // 1
    (-0.3535533905932738 -0.3535533905932738 -0.2) // 2
    (0.3535533905932738 -0.3535533905932738 -0.2) // 3
    (0.7071067811865476 0.7071067811865476 -0.2) // 4
    (-0.7071067811865476 0.7071067811865476 -0.2) // 5
    (-0.7071067811865476 -0.7071067811865476 -0.2) // 6
    (0.7071067811865476 -0.7071067811865476 -0.2) // 7

    (0.3535533905932738 0.3535533905932738 0.2) // 8
    (-0.3535533905932738 0.3535533905932738 0.2) // 9
    (-0.3535533905932738 -0.3535533905932738 0.2) //10
    (0.3535533905932738 -0.3535533905932738 0.2) //11
    (0.7071067811865476 0.7071067811865476 0.2) //12
    (-0.7071067811865476 0.7071067811865476 0.2) //13
    (-0.7071067811865476 -0.7071067811865476 0.2) //14
    (0.7071067811865476 -0.7071067811865476 0.2) //15

    (-6.0 6.0 -0.2) //16
    (-6.0 1.1570796326794897 -0.2) //17
    (-6.0 -1.1570796326794897 -0.2) //18
    (-6.0 -6.0 -0.2) //19
    (-1.1570796326794897 6.0 -0.2) //20
    (-1.1570796326794897 1.1570796326794897 -0.2) //21
    (-1.1570796326794897 -1.1570796326794897 -0.2) //22
    (-1.1570796326794897 -6.0 -0.2) //23
    (1.1570796326794897 6.0 -0.2) //24
    (1.1570796326794897 1.1570796326794897 -0.2) //25
    (1.1570796326794897 -1.1570796326794897 -0.2) //26
    (1.1570796326794897 -6.0 -0.2) //27
    (15.0 6.0 -0.2) //28
    (15.0 1.1570796326794897 -0.2) //29
    (15.0 -1.1570796326794897 -0.2) //30
    (15.0 -6.0 -0.2) //31

    (-6.0 6.0 0.2) //32
    (-6.0 1.1570796326794897 0.2) //33
    (-6.0 -1.1570796326794897 0.2) //34
    (-6.0 -6.0 0.2) //35
    (-1.1570796326794897 6.0 0.2) //36
    (-1.1570796326794897 1.1570796326794897 0.2) //37
    (-1.1570796326794897 -1.1570796326794897 0.2) //38
    (-1.1570796326794897 -6.0 0.2) //39
    (1.1570796326794897 6.0 0.2) //40
    (1.1570796326794897 1.1570796326794897 0.2) //41
    (1.1570796326794897 -1.1570796326794897 0.2) //42
    (1.1570796326794897 -6.0 0.2) //43
    (15.0 6.0 0.2) //44
    (15.0 1.1570796326794897 0.2) //45
    (15.0 -1.1570796326794897 0.2) //46
    (15.0 -6.0 0.2) //47

);

blocks
(
    hex ( 0  4  5  1  8 12 13  9) inner (32 50 63) simpleGrading (5.0 1 1)
    hex ( 1  5  6  2  9 13 14 10) inner (32 50 63) simpleGrading (5.0 1 1)
    hex ( 2  6  7  3 10 14 15 11) inner (32 50 63) simpleGrading (5.0 1 1)
    hex ( 3  7  4  0 11 15 12  8) inner (32 50 63) simpleGrading (5.0 1 1)

    hex (17 21 20 16 33 37 36 32) outer (29 29 63) simpleGrading (0.06934334949441322 14.420993610649957 1)
    hex (18 22 21 17 34 38 37 33) outer (29 73 63) simpleGrading (0.06934334949441322 1 1)
    hex (19 23 22 18 35 39 38 34) outer (29 29 63) simpleGrading (0.06934334949441322 0.06934334949441322 1)

    hex (21 25 24 20 37 41 40 36) outer (73 29 63) simpleGrading (1 14.420993610649957 1)
    hex (22 26 25 21 38 42 41 37) outer (73 73 63) simpleGrading (1 1 1)
    hex (23 27 26 22 39 43 42 38) outer (73 29 63) simpleGrading (1 0.06934334949441322 1)

    hex (25 29 28 24 41 45 44 40) outer (39 29 63) simpleGrading (37.40434344477363 14.420993610649957 1)
    hex (26 30 29 25 42 46 45 41) outer (39 73 63) simpleGrading (37.40434344477363 1 1)
    hex (27 31 30 26 43 47 46 42) outer (39 29 63) simpleGrading (37.40434344477363 0.06934334949441322 1)
);

edges
(
    arc  0  1 (0 0.5 -0.2)
    arc  1  2 (-0.5 0 -0.2)
    arc  2  3 (0 -0.5 -0.2)
    arc  3  0 (0.5 0 -0.2)

    arc  4  5 (0 1.0 -0.2)
    arc  5  6 (-1.0 0 -0.2)
    arc  6  7 (0 -1.0 -0.2)
    arc  7  4 (1.0 0 -0.2)

    arc  8  9 (0 0.5 0.2)
    arc  9 10 (-0.5 0 0.2)
    arc 10 11 (0 -0.5 0.2)
    arc 11  8 (0.5 0 0.2)

    arc 12 13 (0 1.0 0.2)
    arc 13 14 (-1.0 0 0.2)
    arc 14 15 (0 -1.0 0.2)
    arc 15 12 (1.0 0 0.2)
);

boundary
(
    cylinder
    {
        type wall;
        faces
        (
            ( 0  8  9  1)
            ( 1  9 10  2)
            ( 2 10 11  3)
            ( 3 11  8  0)
        );
    }

    inner
    {
        type bellerophon;
        donorZone outer;
        faces
        (
            ( 4  5 13 12)
            ( 5  6 14 13)
            ( 6  7 15 14)
            ( 7  4 12 15)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (16 17 33 32)
            (17 18 34 33)
            (18 19 35 34)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (29 28 44 45)
            (30 29 45 46)
            (31 30 46 47)
        );
    }

    sides
    {
        type patch;
        faces
        (
            (20 16 32 36)
            (24 20 36 40)
            (28 24 40 44)

            (19 23 39 35)
            (23 27 43 39)
            (27 31 47 43)
        );
    }

    top
    {
        type patch;
        faces
        (
            ( 12 13  9  8)
            ( 13 14 10  9)
            ( 14 15 11 10)
            ( 15 12  8 11)

            (33 37 36 32)
            (34 38 37 33)
            (35 39 38 34)

            (37 41 40 36)
            (38 42 41 37)
            (39 43 42 38)

            (41 45 44 40)
            (42 46 45 41)
            (43 47 46 42)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            ( 0  1  5  4)
            ( 1  2  6  5)
            ( 2  3  7  6)
            ( 3  0  4  7)

            (16 20 21 17)
            (17 21 22 18)
            (18 22 23 19)

            (20 24 25 21)
            (21 25 26 22)
            (22 26 27 23)

            (24 28 29 25)
            (25 29 30 26)
            (26 30 31 27)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
