tutorials/testcases/flowOverCylinder/cylinder_multiphase_neu/3d/system/fieldAverage
    fieldAverage
    {   
        type            fieldAverage;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;

        fields
        (   
            U   
            {   
                mean        on; 
                prime2Mean  on; 
                base        time;
            }   

            p   
            {   
                mean        on; 
                prime2Mean  off; 
                base        time;
            }   

            k   
            {   
                mean        on; 
                prime2Mean  off; 
                base        time;
            }

            alpha.water
            {   
                mean        on; 
                prime2Mean  off; 
                base        time;
            }
        );  
    } 
